MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J50/mcu.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON1<ABDEN>
extern volatile __bit _DEPRECATED       ABDEN               __at(0x7BF0);	// @ (0xF7E * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUDCON1,0)
// BAUDCON1<ABDEN1>
extern volatile __bit                   ABDEN1              __at(0x7BF0);	// @ (0xF7E * 8 + 0)
#define                                 ABDEN1_bit          _BIT_ACCESS(BAUDCON1,0)
// BAUDCON2<ABDEN2>
extern volatile __bit                   ABDEN2              __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 ABDEN2_bit          _BIT_ACCESS(BAUDCON2,0)
// BAUDCON1<ABDOVF>
extern volatile __bit _DEPRECATED       ABDOVF              __at(0x7BF7);	// @ (0xF7E * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUDCON1,7)
// BAUDCON1<ABDOVF1>
extern volatile __bit                   ABDOVF1             __at(0x7BF7);	// @ (0xF7E * 8 + 7)
#define                                 ABDOVF1_bit         _BIT_ACCESS(BAUDCON1,7)
// BAUDCON2<ABDOVF2>
extern volatile __bit                   ABDOVF2             __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 ABDOVF2_bit         _BIT_ACCESS(BAUDCON2,7)
// SSP1CON2<ACKDT>
extern volatile __bit _DEPRECATED       ACKDT               __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKDT1>
extern volatile __bit                   ACKDT1              __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT1_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP2CON2<ACKDT2>
extern volatile __bit                   ACKDT2              __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 ACKDT2_bit          _BIT_ACCESS(SSP2CON2,5)
// SSP1CON2<ACKEN>
extern volatile __bit _DEPRECATED       ACKEN               __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKEN1>
extern volatile __bit                   ACKEN1              __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN1_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP2CON2<ACKEN2>
extern volatile __bit                   ACKEN2              __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 ACKEN2_bit          _BIT_ACCESS(SSP2CON2,4)
// SSP1CON2<ACKSTAT>
extern volatile __bit _DEPRECATED       ACKSTAT             __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSP1CON2,6)
// SSP1CON2<ACKSTAT1>
extern volatile __bit                   ACKSTAT1            __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT1_bit        _BIT_ACCESS(SSP1CON2,6)
// SSP2CON2<ACKSTAT2>
extern volatile __bit                   ACKSTAT2            __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 ACKSTAT2_bit        _BIT_ACCESS(SSP2CON2,6)
// ADCON1<ACQT0>
extern volatile __bit                   ACQT0               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 ACQT0_bit           _BIT_ACCESS(ADCON1,3)
// ADCON1<ACQT1>
extern volatile __bit                   ACQT1               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 ACQT1_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ACQT2>
extern volatile __bit                   ACQT2               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 ACQT2_bit           _BIT_ACCESS(ADCON1,5)
// UIE<ACTVIE>
extern volatile __bit                   ACTVIE              __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 ACTVIE_bit          _BIT_ACCESS(UIE,2)
// UIR<ACTVIF>
extern volatile __bit                   ACTVIF              __at(0x7B12);	// @ (0xF62 * 8 + 2)
#define                                 ACTVIF_bit          _BIT_ACCESS(UIR,2)
// ADCON1<ADCAL>
extern volatile __bit _DEPRECATED       ADCAL               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 ADCAL_bit           _BIT_ACCESS(ADCON1,6)
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,0)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,1)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,2)
// RCSTA1<ADDEN>
extern volatile __bit _DEPRECATED       ADDEN               __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA1,3)
// RCSTA1<ADDEN1>
extern volatile __bit                   ADDEN1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 ADDEN1_bit          _BIT_ACCESS(RCSTA1,3)
// RCSTA2<ADDEN2>
extern volatile __bit                   ADDEN2              __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 ADDEN2_bit          _BIT_ACCESS(RCSTA2,3)
// UADDR<ADDR0>
extern volatile __bit                   ADDR0               __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 ADDR0_bit           _BIT_ACCESS(UADDR,0)
// UADDR<ADDR1>
extern volatile __bit                   ADDR1               __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 ADDR1_bit           _BIT_ACCESS(UADDR,1)
// UADDR<ADDR2>
extern volatile __bit                   ADDR2               __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 ADDR2_bit           _BIT_ACCESS(UADDR,2)
// UADDR<ADDR3>
extern volatile __bit                   ADDR3               __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 ADDR3_bit           _BIT_ACCESS(UADDR,3)
// UADDR<ADDR4>
extern volatile __bit                   ADDR4               __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 ADDR4_bit           _BIT_ACCESS(UADDR,4)
// UADDR<ADDR5>
extern volatile __bit                   ADDR5               __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 ADDR5_bit           _BIT_ACCESS(UADDR,5)
// UADDR<ADDR6>
extern volatile __bit                   ADDR6               __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 ADDR6_bit           _BIT_ACCESS(UADDR,6)
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON1,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// SSP1CON2<ADMSK1>
extern volatile __bit _DEPRECATED       ADMSK1              __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 ADMSK1_bit          _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<ADMSK11>
extern volatile __bit                   ADMSK11             __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 ADMSK11_bit         _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<ADMSK12>
extern volatile __bit                   ADMSK12             __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 ADMSK12_bit         _BIT_ACCESS(SSP2CON2,1)
// SSP1CON2<ADMSK2>
extern volatile __bit _DEPRECATED       ADMSK2              __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 ADMSK2_bit          _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<ADMSK21>
extern volatile __bit                   ADMSK21             __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 ADMSK21_bit         _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<ADMSK22>
extern volatile __bit                   ADMSK22             __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 ADMSK22_bit         _BIT_ACCESS(SSP2CON2,2)
// SSP1CON2<ADMSK3>
extern volatile __bit _DEPRECATED       ADMSK3              __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 ADMSK3_bit          _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<ADMSK31>
extern volatile __bit                   ADMSK31             __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 ADMSK31_bit         _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<ADMSK32>
extern volatile __bit                   ADMSK32             __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 ADMSK32_bit         _BIT_ACCESS(SSP2CON2,3)
// SSP1CON2<ADMSK4>
extern volatile __bit _DEPRECATED       ADMSK4              __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ADMSK4_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ADMSK41>
extern volatile __bit                   ADMSK41             __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ADMSK41_bit         _BIT_ACCESS(SSP1CON2,4)
// SSP2CON2<ADMSK42>
extern volatile __bit                   ADMSK42             __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 ADMSK42_bit         _BIT_ACCESS(SSP2CON2,4)
// SSP1CON2<ADMSK5>
extern volatile __bit _DEPRECATED       ADMSK5              __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ADMSK5_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ADMSK51>
extern volatile __bit                   ADMSK51             __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ADMSK51_bit         _BIT_ACCESS(SSP1CON2,5)
// SSP2CON2<ADMSK52>
extern volatile __bit                   ADMSK52             __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 ADMSK52_bit         _BIT_ACCESS(SSP2CON2,5)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// PMCONH<ADRMUX0>
extern volatile __bit                   ADRMUX0             __at(0x7A5B);	// @ (0xF4B * 8 + 3)
#define                                 ADRMUX0_bit         _BIT_ACCESS(PMCONH,3)
// PMCONH<ADRMUX1>
extern volatile __bit                   ADRMUX1             __at(0x7A5C);	// @ (0xF4B * 8 + 4)
#define                                 ADRMUX1_bit         _BIT_ACCESS(PMCONH,4)
// WDTCON<ADSHR>
extern volatile __bit                   ADSHR               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 ADSHR_bit           _BIT_ACCESS(WDTCON,4)
// PMCONL<ALP>
extern volatile __bit                   ALP                 __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 ALP_bit             _BIT_ACCESS(PMCONL,5)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTF<AN10>
extern volatile __bit                   AN10                __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 AN10_bit            _BIT_ACCESS(PORTF,5)
// PORTF<AN11>
extern volatile __bit                   AN11                __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 AN11_bit            _BIT_ACCESS(PORTF,6)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,5)
// PORTF<AN7>
extern volatile __bit                   AN7                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 AN7_bit             _BIT_ACCESS(PORTF,2)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// IPR2<BCL1IP>
extern volatile __bit                   BCL1IP              __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCL1IP_bit          _BIT_ACCESS(IPR2,3)
// PIE3<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x7D1E);	// @ (0xFA3 * 8 + 6)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x7D26);	// @ (0xFA4 * 8 + 6)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR3,6)
// IPR3<BCL2IP>
extern volatile __bit                   BCL2IP              __at(0x7D2E);	// @ (0xFA5 * 8 + 6)
#define                                 BCL2IP_bit          _BIT_ACCESS(IPR3,6)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// PMCONL<BEP>
extern volatile __bit                   BEP                 __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 BEP_bit             _BIT_ACCESS(PMCONL,2)
// SSP1STAT<BF>
extern volatile __bit _DEPRECATED       BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP2STAT<BF2>
extern volatile __bit                   BF2                 __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 BF2_bit             _BIT_ACCESS(SSP2STAT,0)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// BAUDCON1<BRG16>
extern volatile __bit _DEPRECATED       BRG16               __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON1,3)
// BAUDCON1<BRG161>
extern volatile __bit                   BRG161              __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 BRG161_bit          _BIT_ACCESS(BAUDCON1,3)
// BAUDCON2<BRG162>
extern volatile __bit                   BRG162              __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 BRG162_bit          _BIT_ACCESS(BAUDCON2,3)
// TXSTA1<BRGH>
extern volatile __bit _DEPRECATED       BRGH                __at(0x7D6A);	// @ (0xFAD * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA1,2)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D6A);	// @ (0xFAD * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// TXSTA2<BRGH2>
extern volatile __bit                   BRGH2               __at(0x7D42);	// @ (0xFA8 * 8 + 2)
#define                                 BRGH2_bit           _BIT_ACCESS(TXSTA2,2)
// UEIE<BTOEE>
extern volatile __bit                   BTOEE               __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 BTOEE_bit           _BIT_ACCESS(UEIE,4)
// UEIR<BTOEF>
extern volatile __bit                   BTOEF               __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 BTOEF_bit           _BIT_ACCESS(UEIR,4)
// UEIE<BTSEE>
extern volatile __bit                   BTSEE               __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 BTSEE_bit           _BIT_ACCESS(UEIE,7)
// UEIR<BTSEF>
extern volatile __bit                   BTSEF               __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 BTSEF_bit           _BIT_ACCESS(UEIR,7)
// PMMODEH<BUSY>
extern volatile __bit                   BUSY                __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 BUSY_bit            _BIT_ACCESS(PMMODEH,7)
// CM1CON1<C1CH0>
extern volatile __bit _DEPRECATED       C1CH0               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON1,0)
// CM2CON1<C1CH02>
extern volatile __bit                   C1CH02              __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 C1CH02_bit          _BIT_ACCESS(CM2CON1,0)
// CM1CON1<C1CH1>
extern volatile __bit _DEPRECATED       C1CH1               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON1,1)
// CM2CON1<C1CH12>
extern volatile __bit                   C1CH12              __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 C1CH12_bit          _BIT_ACCESS(CM2CON1,1)
// PORTF<C1INA>
extern volatile __bit                   C1INA               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 C1INA_bit           _BIT_ACCESS(PORTF,6)
// PORTF<C1INB>
extern volatile __bit                   C1INB               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 C1INB_bit           _BIT_ACCESS(PORTF,5)
// PORTF<C1OUT>
extern volatile __bit                   C1OUT               __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 C1OUT_bit           _BIT_ACCESS(PORTF,7)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// PORTA<C2INA>
extern volatile __bit                   C2INA               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 C2INA_bit           _BIT_ACCESS(PORTA,5)
// PORTF<C2INB>
extern volatile __bit                   C2INB               __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C2INB_bit           _BIT_ACCESS(PORTF,2)
// PORTC<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 C2OUT_bit           _BIT_ACCESS(PORTC,5)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON1<CCH01>
extern volatile __bit                   CCH01               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON1,0)
// CM2CON1<CCH02>
extern volatile __bit                   CCH02               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON1,0)
// CM1CON1<CCH11>
extern volatile __bit                   CCH11               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON1,1)
// CM2CON1<CCH12>
extern volatile __bit                   CCH12               __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON1,1)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// ECCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(ECCP1CON,0)
// ECCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD9);	// @ (0xFBB * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(ECCP1CON,1)
// ECCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(ECCP1CON,2)
// ECCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DDB);	// @ (0xFBB * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(ECCP1CON,3)
// ECCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(ECCP1CON,5)
// ECCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(ECCP1CON,4)
// PORTE<CCP2E>
